print("......................... ")
a = "单号: DH201409230001 "
b = "时间：2014-09-23 08:56:14 "
print("------------------------- ")
c = "名称\t\t\t数量\t单价\t\t金额 "
d = "金士顿U盘\t1\t50.00\t50.00\n8GB "
e = "盛创16GBTF\t1\t50.00\t50.00\n卡 "
f = "读卡器\t\t1\t8.00\t8.00 "
g = "网线2米\t\t1\t5.00\t5.00 "
print(a, b, c, d, e, f, g, sep='\n')
print("-------------------------\n"
      "总数:4           总额：103.00\n"
      "折后总额:103.00              \n"
      "实收:103.00      找零:0.00   ")

print("         谢谢你         ")
print("你于2019年11月3日申请种植的梭梭树,\n已被中国扶贫基金会认领，将种植到武威地区。")
print("         树苗编号\n"
      "    NO.HFK20308960305")

admin = input("请输入账号:")
password = input("请输入密码:")
if admin == "admin" and password == "123456":
    print("欢迎admin登录本系统")
else:
    print("密码错误")
